Enums/ПодтверждениеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПодтверждениеДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Верные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неверные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Представление/Ext/Module.bsl
Функция глПредставлениеПодтверждения(Значение) Экспорт

	Если Значение = ПредопределенноеЗначение("Перечисление.ПодтверждениеДанных.Верные") Тогда
		Представление = "[В]";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ПодтверждениеДанных.Неверные") Тогда
		Представление = "[х]";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ПодтверждениеДанных.НеПодтвержденные") Тогда
		Представление = "[?]";
	Иначе
		Представление = "[?]";
	КонецЕсли; 
	
	Возврат Представление;
КонецФункции // Подтверждение()
